In [173]:
import pandas as pd
import numpy as np

In [262]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',  
'londON_StockhOlm', 
'Budapest_PaRis', 'Brussels_londOn'], 
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085], 
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]], 
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )', 
'12. Air France', '"Swiss Air"']})

In [263]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [264]:
#ANSWER 1

df['FlightNumber'].fillna({1:100055,3:10075},inplace=True)

In [265]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN      100055.0            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis       10075.0          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [266]:
df.dtypes

From_To          object
FlightNumber    float64
RecentDelays     object
Airline          object
dtype: object

In [287]:
df=df.astype({'FlightNumber':int})
df.dtypes

FlightNumber      int32
Airline          object
From             object
TO               object
delays1         float64
delays2         float64
delays3         float64
dtype: object

In [268]:
#Answer2

expand=df['From_To'].str.split("_",expand=True)

In [269]:
expand.columns=['From','To']

In [270]:
expand

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

In [271]:
#Answer 3

expand['From']=expand['From'].str.capitalize()
expand['To']=expand['To'].str.capitalize()

In [272]:
expand

       From         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

In [273]:
#Answer4

df.drop("From_To",axis=1,inplace=True)

In [274]:
df

   FlightNumber  RecentDelays              Airline
0       10045.0      [23, 47]               KLM(!)
1      100055.0            []    <Air France> (12)
2       10065.0  [24, 43, 87]  (British Airways. )
3       10075.0          [13]       12. Air France
4       10085.0      [67, 32]          "Swiss Air"

In [275]:
df[['From','TO']]=expand

In [276]:
df

   FlightNumber  RecentDelays              Airline      From         TO
0       10045.0      [23, 47]               KLM(!)    London      Paris
1      100055.0            []    <Air France> (12)    Madrid      Milan
2       10065.0  [24, 43, 87]  (British Airways. )    London  Stockholm
3       10075.0          [13]       12. Air France  Budapest      Paris
4       10085.0      [67, 32]          "Swiss Air"  Brussels     London

In [277]:
#ANSWER 5

delays=df['RecentDelays'].apply(pd.Series)
delays

      0     1     2
0  23.0  47.0   NaN
1   NaN   NaN   NaN
2  24.0  43.0  87.0
3  13.0   NaN   NaN
4  67.0  32.0   NaN

In [280]:
df[['delays1','delays2','delays3']]=delays

In [281]:
df

,FlightNumber,RecentDelays,Airline,From,TO,delays1,delays2,delays3
0,10045.0,"[23, 47]",KLM(!),London,Paris,23.0,47.0,NaN
1,100055.0,[],<Air France> (12),Madrid,Milan,NaN,NaN,NaN
2,10065.0,"[24, 43, 87]",(British Airways. ),London,Stockholm,24.0,43.0,87.0
3,10075.0,[13],12. Air France,Budapest,Paris,13.0,NaN,NaN
4,10085.0,"[67, 32]","""Swiss Air""",Brussels,London,67.0,32.0,NaN

In [283]:
df.drop('RecentDelays',axis=1,inplace=True)

In [284]:
df

,FlightNumber,Airline,From,TO,delays1,delays2,delays3
0,10045.0,KLM(!),London,Paris,23.0,47.0,NaN
1,100055.0,<Air France> (12),Madrid,Milan,NaN,NaN,NaN
2,10065.0,(British Airways. ),London,Stockholm,24.0,43.0,87.0
3,10075.0,12. Air France,Budapest,Paris,13.0,NaN,NaN
4,10085.0,"""Swiss Air""",Brussels,London,67.0,32.0,NaN